#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Provider Reporting Portal Frontend"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PRP Web"
      + oauth2_device_authorization_grant_enabled = false
      + pkce_code_challenge_method                = "S256"
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
        ]
      + web_origins                               = [
          + "*",
        ]
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MSPDIRECT-SERVICE.module.client-roles.keycloak_role.ROLES["SOCIALSECTOR"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "398434c7-10f7-4559-9ae5-efd9723f2593"
      + id        = (known after apply)
      + name      = "SOCIALSECTOR"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MSPDIRECT-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["MSPDIRECT-SERVICE/SOCIALSECTOR"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "b69bc4b8-b36b-40e9-9a32-0096530d1e7c"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["ADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ADMIN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["MSPQI"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MSPQI"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PMP"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "PMP"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRP-SERVICE/ADMIN"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRP-SERVICE/MSPQI"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRP-SERVICE/PMP"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*